[
  {
    "id": 1,
    "title": "A Mother’s Unconditional Love",
    "excerpt": "Celebrating the endless devotion of mothers worldwide.",
    "content": "🌸 A Mother’s Unconditional Love\n\"The purest echo in our hearts, the quiet strength in our lives.\"\n\nMothers are the heartbeats of our lives — giving without measure, loving without condition, and standing by us with unshakable strength. This heartfelt tribute dives deep into the silent sacrifices and immeasurable affection that define maternal love. It’s a reminder that a mother’s embrace is not just comfort — it’s the purest form of home. Mothers are the heartbeats of our lives — giving without measure, loving without condition, and standing by us with unshakable strength. This heartfelt tribute dives deep into the silent sacrifices and immeasurable affection that define maternal love. It’s a reminder that a mother’s embrace is not just comfort — it’s the purest form of home. Mothers are the heartbeats of our lives — giving without measure, loving without condition, and standing by us with unshakable strength. This heartfelt tribute dives deep into the silent sacrifices and immeasurable affection that define maternal love. It’s a reminder that a mother’s embrace is not just comfort — it’s the purest form of home.",
    "author": "Jane Doe",
    "date": "2025-04-20",
    "category": "Stories",
    "readingTime": 5,
    "imageUrl": "../assets/mother-5.jpg"
  },
  {
    "id": 2,
    "title": "Nurturing Health for Moms",
    "excerpt": "Essential wellness tips for every mother’s journey.",
    "content": "Mothers deserve care too. Discover rituals like yoga, nutritious meals, and quiet moments to rejuvenate the heart of the family. A mother’s well-being is just as important as the care she provides to others. This article shares essential wellness practices tailored for moms — from mental health awareness and balanced nutrition to sleep, exercise, and self-care — empowering mothers to prioritize their health while continuing to nurture their families with love and strength A mother’s well-being is just as important as the care she provides to others. This article shares essential wellness practices tailored for moms — from mental health awareness and balanced nutrition to sleep, exercise, and self-care — empowering mothers to prioritize their health while continuing to nurture their families with love and strength A mother’s well-being is just as important as the care she provides to others. This article shares essential wellness practices tailored for moms — from mental health awareness and balanced nutrition to sleep, exercise, and self-care — empowering mothers to prioritize their health while continuing to nurture their families with love and strength",
    "author": "Emily Smith",
    "date": "2025-04-18",
    "category": "Health",
    "readingTime": 7,
    "imageUrl": "../assets/mother-6.jpg"
  },
  {
    "id": 3,
    "title": "Inspiring Maternal Legacies",
    "excerpt": "Mothers who transformed lives with courage.",
    "content": "From building communities to raising leaders, these mothers leave a legacy of inspiration that echoes through generations.Some mothers leave behind more than memories — they leave legacies of courage, resilience, and transformation. This inspiring piece highlights real-life stories of mothers who overcame adversity, broke barriers, and changed the lives of those around them. It celebrates the unshakable spirit of women who led not just families, but movements. Some mothers leave behind more than memories — they leave legacies of courage, resilience, and transformation. This inspiring piece highlights real-life stories of mothers who overcame adversity, broke barriers, and changed the lives of those around them. It celebrates the unshakable spirit of women who led not just families, but movements. Some mothers leave behind more than memories — they leave legacies of courage, resilience, and transformation. This inspiring piece highlights real-life stories of mothers who overcame adversity, broke barriers, and changed the lives of those around them. It celebrates the unshakable spirit of women who led not just families, but movements.",
    "author": "Sarah Johnson",
    "date": "2025-04-15",
    "category": "Inspiration",
    "readingTime": 6,
    "imageUrl": "../assets/mother-7.jpg"
  },
  {
    "id": 4,
    "title": "Mother’s Day Traditions",
    "excerpt": "Global celebrations honoring maternal bonds.",
    "content": "From flower crowns to family feasts, explore how cultures worldwide cherish their mothers on this special day.Motherhood is celebrated in countless ways around the world. From Japan’s carnations to Ethiopia’s festive feasts, this article explores diverse global traditions that honor mothers with love, gratitude, and cultural richness. It’s a beautiful journey through customs that remind us that maternal bonds are universally cherished.Motherhood is celebrated in countless ways around the world. From Japan’s carnations to Ethiopia’s festive feasts, this article explores diverse global traditions that honor mothers with love, gratitude, and cultural richness. It’s a beautiful journey through customs that remind us that maternal bonds are universally cherished.",
    "author": "Anna Lee",
    "date": "2025-04-10",
    "category": "Stories",
    "readingTime": 4,
    "imageUrl": "../assets/mother-8.jpg"
  },
  {
    "id": 5,
    "title": "Mindful Moments for Moms",
    "excerpt": "Finding peace in a mother’s busy world.",
    "content": "This guide offers meditation and self-care practices to help mothers find balance and serenity amidst life’s chaos. Amid the chaos of parenting, mindfulness offers mothers a way to breathe, reflect, and reconnect with themselves. This article offers simple, effective practices for cultivating peace — from meditation and journaling to small acts of self-kindness. It’s a gentle guide for mothers to find calm within, one mindful moment at a time. Amid the chaos of parenting, mindfulness offers mothers a way to breathe, reflect, and reconnect with themselves. This article offers simple, effective practices for cultivating peace — from meditation and journaling to small acts of self-kindness. It’s a gentle guide for mothers to find calm within, one mindful moment at a time. Amid the chaos of parenting, mindfulness offers mothers a way to breathe, reflect, and reconnect with themselves. This article offers simple, effective practices for cultivating peace — from meditation and journaling to small acts of self-kindness. It’s a gentle guide for mothers to find calm within, one mindful moment at a time.",
    "author": "Maria Gonzalez",
    "date": "2025-04-12",
    "category": "Health",
    "readingTime": 6,
    "imageUrl": "../assets/mother-9.jpg"
  }
]